export interface quotationItem {
  content: string;
  date: string;
  source: string;
  profession?: string;
}

export const quotationData: quotationItem[] = [
  {
    content: "自律使我自由。",
    source: "【Keep App】",
    date: "2020-01-01",
  },
  {
    content: "这么年轻，升本+考验，同时软考。",
    source: "佚名",
    date: "2020-01-01",
  },
  {
    content: "我们不能站在现在的高度去评判当年的自己这不公平，如果重来一次，以当年的阅历和心智也会做出同样的选择。",
    source: "佚名",
    date: "2020-01-01",
  },
  {
    content: "我要悄悄的努力，然后惊艳所有人。",
    source: "佚名",
    date: "2021-03-25",
  },
  {
    content: "除非别人主动向你请教，否则，不要强行去说教别人，以希望别人改变。",
    source: "佚名",
    date: "2021-03-31",
  },
  {
    content:
      "我们曾如此渴望命运的波澜，到最后才发现：人生最曼妙的风景，竟是内心的淡定与从容……我们曾如此期盼外界的认可，到最后才知道：世界是自己的，与他人毫无关系。",
    source: "【一百岁感言】杨绛",
    date: "2021-04-12",
  },
  {
    content: "只要慢慢走，正确的路一定会越走越远。",
    source: "【电影：实习生】",
    date: "2021-04-26",
  },
  {
    content: "意愿和本性会带你到属于你的地方。",
    source: "【有知有行App】",
    date: "2021-04-26",
  },
  {
    content: "「四笔钱」，就是把我们用来投资的钱分成四笔：保险保障、活钱管理、稳健理财、长期投资。",
    source: "【有知有行App】 ",
    date: "2021-05-05",
  },
  {
    content:
      "微信不是一个工具，心理满足的驱动力远胜工具甚至省钱。我们让用户使用的驱动力确实不是来自这是一个工具，或者是省钱。如果把微信定位成比短信更省钱的工具，那么微信可能就失败了。工具的吸引力是不够的，所以，将微信定位成了：微信是一个生活方式。",
    source: "张小龙",
    date: "2021-05-12",
  },
  {
    content:
      "别人的好，是会逼着我去察觉我的长处在哪里的。你会很笃定地知道，没错我自卑，但是自卑是我的燃料，会让我去学习别人怎么去达成他的目标，我要怎么达成我的目标，这叫做——做自己。",
    source: "蔡康永",
    date: "2021-06-13",
  },
  {
    content: "简单比复杂更难，你必须努力让你的想法变得清晰明了，让它变得简单。",
    source: "乔布斯",
    date: "2021-07-01",
  },
  {
    content: "你的每一个行动，都是对你想成为怎样的人的投票。",
    source: "詹姆斯•克利尔（James Clear）",
    profession: "美国习惯研究专家",
    date: "2023-10-31",
  },
  {
    content: "他们的大学故事，始于一场初秋，终于一场盛夏。",
    source: "佚名",
    date: "2023-10-31",
  },
  {
    content: "一周是一年的2%",
    source: "纳特·弗里德曼（Nat Friedman）",
    profession: "前 GitHub CEO / 风险投资家",
    date: "2024-03-15",
  },
  {
    content: "在你没有办法说服自己前，不要想着去说服别人。",
    source: "minsion",
    date: "2024-07-13",
  },
  {
    content: "永远不要向任何人透露自己的底牌，凡是留一手。",
    source: "minsion",
    date: "2024-07-13",
  },
  {
    content: "没有真正信得过的人，只有站得住的利益。",
    source: "minsion",
    date: "2024-07-13",
  },
  {
    content: "无论发生什么，都不要觉得意外，都要以平常心对待。",
    source: "minsion",
    date: "2024-07-13",
  },
  {
    content: "学会利他，合作前先换位思考，明确对方的诉求。",
    source: "minsion",
    date: "2024-07-13",
  },
  {
    content: "不要把产品想的太复杂，遵循最小可用性原则，先快速验证、持续迭代。",
    source: "minsion",
    date: "2024-07-13",
  },
  {
    content: "注重公司的内部沉淀，尤其是工作流和规范文档。",
    source: "minsion",
    date: "2024-07-13",
  },
  {
    content: "记录下自己的创业过程，这是独特的经验，也是宝贵的财富。",
    source: "minsion",
    date: "2024-07-13",
  },
  {
    content: "身体诗革命的本钱，要做好长线发展的准备，不要盲目焦虑。",
    source: "minsion",
    date: "2024-07-13",
  },
  {
    content: "时刻保持警惕，假定最坏的结果会发生并提前做好兜底策略。",
    source: "minsion",
    date: "2024-07-13",
  },
  {
    content:
      "这个世界上，没有失败，只有反馈。本质上我们的人生是不存在失败的，因为我们来和去的终点都是一样的，如果我们是一个成长的心态，你经历的所有困难、所有的挫折，只是真实世界给你的一个反馈。",
    source: "国辉老师",
    date: "2024-05-11",
  },
  {
    content: "人的一生就是解决三个基本问题：事业、家庭和财务。",
    source: "佚名",
    date: "2024-05-17",
  },
  {
    content:
      "不要将技术博客的写作视作打造“个人品牌”，它肯定对此有所帮助。但是，写作最重要的功能是，它是提升个人知识和批判思维的一个工具。",
    source: "【为别人而写，但主要是为自己而写】",
    date: "2024-05-17",
  },
  {
    content: "瓶装水的保质期，指的是塑料瓶的保质期，而不是水的保质期。纯净水是不会变质的。",
    source: "【BusinessInsider.com】",
    date: "2024-05-17",
  },
  {
    content: "时间就是金钱，效率就是生命。",
    source: "【郑州】",
    date: "2024-05-27",
  },
];
